In [58]:
import pandas as pd
data1=pd.read_csv(r'../result/857df17bc379e67f68c7f504eb773c9b-baseline.csv')
data2=pd.read_csv(r'../result/baseline_online.csv')
data3=pd.read_csv(r'../result/baseline_online_v2.csv')
data4=pd.read_csv(r'../result/59368ee81b185cd889626b6b5b23637c-result.csv')

In [59]:
data1.head()

   RECRUIT_ID  PERSON_ID  LABEL
0    43993651    2817337      1
1    42710688  316195953      1
2    43993651  320767945      1
3    43897745    5686796      1
4    42844699  316458035      1

In [60]:
data2.head()

   RECRUIT_ID  PERSON_ID  LABEL
0    42922925    4115360      1
1    42559662      48956      1
2    43892655  320242928      1
3    43922680  320355911      1
4    42844699  316458035      1

In [61]:
data3.head()

   RECRUIT_ID  PERSON_ID  LABEL
0    42922925    4115360      1
1    42559662      48956      1
2    43892655  320242928      1
3    43922680  320355911      1
4    42844699  316458035      1

In [67]:
data1=pd.merge(data1,data4,on=["RECRUIT_ID","PERSON_ID"])
data2=pd.merge(data2,data4,on=["RECRUIT_ID","PERSON_ID"])
data3=pd.merge(data3,data4,on=["RECRUIT_ID","PERSON_ID"])
# data=pd.merge(data3,data4,on=["RECRUIT_ID","PERSON_ID"])

In [68]:
sum(data1.LABEL_x==data1.LABEL_y)

69980

In [69]:
sum(data2.LABEL_x==data2.LABEL_y)

70192

In [56]:
data=pd.merge(data2,data3,on=["RECRUIT_ID","PERSON_ID"])

In [57]:
sum(data.LABEL_x==data.LABEL_y)

70774

In [19]:
data.LABEL_y.value_counts()

0    6000
1    1059
Name: LABEL_y, dtype: int64

In [20]:
data.LABEL_x.value_counts()

0    6000
1    1059
Name: LABEL_x, dtype: int64

In [22]:
sum(data.LABEL_x==data.LABEL_y)

5427